app/Controllers/Auth.php

    public function register()
    {
        helper(['form']);

        if ($this->request->getMethod() === 'post') {
            $rules = [
                'name' => 'required|min_length[3]|max_length[100]',
                'email' => 'required|valid_email|is_unique[users.email]',
                'password' => 'required|min_length[6]',
                'confirm_password' => 'required|matches[password]'
            ];

            if (!$this->validate($rules)) {
                return view('auth/register', [
                    'validation' => $this->validator
                ]);
            }

            $userModel = new UserModel();
            $data = [
                'name' => $this->request->getPost('name'),
                'email' => $this->request->getPost('email'),
                'password' => password_hash($this->request->getPost('password'), PASSWORD_BCRYPT)
            ];

            if ($userModel->insert($data)) {
---
INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Nowell Terrenal', '423003803@ntc.edu.ph', '$2y$10$w9d6SfCn.GYlwkU4uDiu1.qxCtu16c2US7yBu77A.Lgn85RnqGwum')